"""Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число Х """

N = int(input("Введите количество элементов в массиве: "))

import random

A = [random.randint(0, 100) for _ in range(N)]
print(f"Исходный массив: {A}")

X = int(input("Введите число X, которое будем сравнивать: "))
i = 0
index = 0

for num in A:
    count = abs(X - A[i])
    min = abs(X - A[0])
    index = 0
    if count < min:
       min = count
       index = i

print(f"Самое близкое по значению к числу {X} будет число {A[index]}")
