"""Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X"""

N = int(input("Введите количество элементов в массиве: "))

import random

A = [random.randint(0, 100) for _ in range(N)]
print(f"Исходный массив: {A}")

X = int(input("Введите число которое требуется посчитать: "))
result = []

print(f"Число {X} содержится в массиве {A.count(X)} раз")

