"""Дан список чисел. Определите сколько в нем встречается различных чисел"""

import random

s = [random.randint(0, 100) for _ in range(10)]  ##random.randint - функция через которую создаем список из рандомных чисел. 
## Вместо i ставим _ Так пайтон понимаем что это переменная не так важна и не нужна нам и будет выкидвать из памяти
s_copy = s.copy()

for num in s_copy:  ##Делаем копию исходного массива, чтобы когда запустился цикл мы проходили по нему, а не по отредактированному массиву и перескакивали через яцейки с числами
    while s.count(num) != 1:  ##проверяем чтобы число встречалось только один раз. Если нет, то надо его удалить
        s.remove(num)  ##удаляем из массива повторяющиеся элементы
print(s)
print(len(s))
