"""Дана последовательность из N целых чисел и число К. Необходимо сдвинуть всю последовательность (сдвиг - циклический) на К элементов
вправо, К - положительное число"""

import random

s = [random.randint(0, 100) for _ in range(10)]

k = 3
k = k % len(s) ## на данном этапе проверяем на сколько действительно раз надо сместить цикл. Если К будет огромным, например, 34456, мы мнооого раз будет возвращаться в исходное положение массива. 
## Чтобы не делать лишних действий и не тратить время, мы проверяем сколько действий мы делаем.

list_result = []
len_list = len(s)

for i in range(len_list - k, len_list):
    list_result.append(s[i])
for i in range(len_list - k):
    list_result.append(s[i])
print(s)
print(list_result)