"""Найдите сумму цифр трехзначного числа"""

i = int(input("Введите трехзначное число: "))

a = i // 100
b = i % 10
c = i % 100 // 10

print(a + b + c)
