"""Дано натуральное число А > 1. Определите, каким по счету числом Фибоначчи
оно является, то есть выведите число n, что f(n) = A.
Если А не является числом Фибоначчи, выведите число -1"""

A = int(input("A = "))

a1 = 0
a2 = 1
i = 2

while a2 < A:
    a1, a2 = a2, a1 + a2
    i += 1
    if a2 > A:
        i = -1
print(i)
